## prod
#### Terraform Initialization :gear: `success`
#### Terraform Plan :book: `success`

<details><summary>Show Plan</summary>

```terraform
module.GKE.module.vpc.google_compute_network.my_vpc: Refreshing state... [id=projects/guitarnetes1/global/networks/gke-vpc-1]
module.GKE.module.vpc.google_compute_address.nat: Refreshing state... [id=projects/guitarnetes1/regions/us-east1/addresses/cluster-nat]
module.GKE.module.vpc.google_compute_router.router: Refreshing state... [id=projects/guitarnetes1/regions/us-east1/routers/router]
module.GKE.module.subnet.google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/guitarnetes1/regions/us-east1/subnetworks/private-subnet]
module.GKE.google_container_cluster.primary: Refreshing state... [id=projects/guitarnetes1/locations/us-east1/clusters/guitarnetes-gke]
module.GKE.module.vpc.google_compute_router_nat.nat: Refreshing state... [id=guitarnetes1/us-east1/router/cluster-nat]
module.GKE.module.node_pool.google_container_node_pool.primary_nodes: Refreshing state... [id=projects/guitarnetes1/locations/us-east1/clusters/guitarnetes-gke/nodePools/node-pool]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.GKE.google_container_cluster.primary must be replaced
-/+ resource "google_container_cluster" "primary" {
      ~ cluster_ipv4_cidr           = "10.116.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
      ~ default_max_pods_per_node   = 110 -> (known after apply)
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      - enable_tpu                  = false -> null
      ~ endpoint                    = "34.75.57.177" -> (known after apply)
      ~ id                          = "projects/guitarnetes1/locations/us-east1/clusters/guitarnetes-gke" -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.27.3-gke.100" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
      ~ name                        = "guitarnetes-gke" -> "guitarnetes-gke-1" # forces replacement
      ~ network                     = "projects/guitarnetes1/global/networks/gke-vpc-1" -> "gke-vpc-1"
      ~ networking_mode             = "VPC_NATIVE" -> (known after apply)
      ~ node_locations              = [
          - "us-east1-b",
          - "us-east1-c",
          - "us-east1-d",
        ] -> (known after apply)
      ~ node_version                = "1.27.4-gke.900" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      ~ project                     = "guitarnetes1" -> (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1/projects/guitarnetes1/locations/us-east1/clusters/guitarnetes-gke" -> (known after apply)
      ~ services_ipv4_cidr          = "10.120.0.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/guitarnetes1/regions/us-east1/subnetworks/private-subnet" -> "private-subnet"
      + tpu_ipv4_cidr_block         = (known after apply)
        # (8 unchanged attributes hidden)

      - addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      - ip_allocation_policy {
          - cluster_ipv4_cidr_block       = "10.116.0.0/14" -> null
          - cluster_secondary_range_name  = "gke-guitarnetes-gke-pods-ec40f406" -> null
          - services_ipv4_cidr_block      = "10.120.0.0/20" -> null
          - services_secondary_range_name = "gke-guitarnetes-gke-services-ec40f406" -> null
          - stack_type                    = "IPV4" -> null

          - pod_cidr_overprovision_config {
              - disabled = false -> null
            }
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      - master_auth {
          - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMRENDQXBTZ0F3SUJBZ0lRZDN3Z2lTRDUwUUN0eFFIaTYwc3VBekFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlSaU1URmtNbVJrTVMwNU5URXdMVFF3WmpVdE9UWTBPQzFrTkdWaFlXWm1OakEwTURjdwpJQmNOTWpNeE1URXhNVEl3T0RJd1doZ1BNakExTXpFeE1ETXhNekE0TWpCYU1DOHhMVEFyQmdOVkJBTVRKR0l4Ck1XUXlaR1F4TFRrMU1UQXROREJtTlMwNU5qUTRMV1EwWldGaFptWTJNRFF3TnpDQ0FhSXdEUVlKS29aSWh2Y04KQVFFQkJRQURnZ0dQQURDQ0FZb0NnZ0dCQU03bHdEMTMraEg5SE5VY0lwbUNjZUtoT0tMeHdQNFZlUFFJWlF3NwpJQUxBMkFZVTN0OVl6QTE4MUR2UWpUSkZITGpyTzdEY0dwZFRiM01taDJ1d0YvbUtveVZDZFZWTHpQNkJRcGl3CkhiTXA2ajU3aVViVVBnTFFGeWJoT1JVaTFlV0kvczNYYWJmSitnWXl5RUxrSVc2a01vRWtYQjYxUVdsRWJJQ3gKMXBuN2pYTUxKOGQ0OEQ1SHVtUVlKblF4STh6Y2pzcmNlWjk2UzNwV1pNZ2Y2dlV5VWx2aytlSEpiMmFxaTYvKwppMFhvSTMyTVZyL0ZRNUMxR3NVZGhSWDhjanhESFV6V0JheGlPMGhIR0FjbDZXTmJIWUpwTVVvRjFxOGt5WENaCkZPN0dsUytIU2Q0ZnJYUnRDcEdkZisxT0k1cndDSEJZejAvRFhjNXhCY3MzWXhUY3JkaGZrRDVPM3VXZTJnOFYKTG9LU3Y1TWJXVDZjV2hrQXk2c2RnYjJRVEt6MDkrQk1vSzFnNExwK0tTNENNUEV5eEtkQjJsVzBOZUE2V202YwpERXZsN2VsVmJnbnpVUTZ5Qk9EMWRocWRwVjROZzVQT1YzSWs0blpIcmxPRnR5bHVIWkR1T3pRVnFqSWtvWlBBClIzRnlJeGJUSnJaZXd3ajZFWEd6N2g3Uy93SURBUUFCbzBJd1FEQU9CZ05WSFE4QkFmOEVCQU1DQWdRd0R3WUQKVlIwVEFRSC9CQVV3QXdFQi96QWRCZ05WSFE0RUZnUVU5N2tmd0FzQ1R3anRPNHhjeW1IQXZFaUtGTU13RFFZSgpLb1pJaHZjTkFRRUxCUUFEZ2dHQkFIQUhQVWp6KzVLTWgyWXI3SzA1TWZlNlZOVVNHL2NoRmxRZlJWbU44bkllCk01a3ZhNU9vWTRVeHoxNWxoM0Eyb25aejhxVkppdEM2VTBBKzlkaVU2QjV4VUhnUGNUc0RKb1AvcC8vV3JPZWsKa0djVHhoLzg1K25TZE0wZGRPUzNKOURNUXNoeGRWUjRPR3V4NktZU3dDNnR1ajZRNDVkc01McUhzdDcxSjRWYQpML054VlNpVGtvZG1CWTJQSFd6RFB6YW0vYzhLekVzd2M4TlVQejYvbk1vK25xb0FQL2N6bjZQYjF0M0FXeWkzCitLZzRMNXpqbDgycmYzM2kzS3U1UzQ0bzB6M0t0bnd2cVUxb1M2aDFZeXpWdTNrMWJmd3ZGTmxzVWpWWWIwZnEKMmsxMW5kZk9nMW14WHpKbEZDZHJ6c2c2WVgwUnQ4Mld0UnJILzhTc1hzb01qNnJoRWRCQ1NLemE4azQ0Z2J0ZApnOUtqeXp6d3F0bjRUaG5sV09kdzdVT3RsaGdIWjRMOCtNblAvN2ZkQWt4dEJqdVY3eGVjQVRITUhUc3lrUmJ1CldsTDZ5SEtMU3Q1TU1oUVYrUFZZUWFERzBwN3RFdDV1UzNmWVVEWXlLS0pUNUVpM0tIeGZ5OHVyODNPN2h4bjQKdm9TMzV3RWRmbUFkbzR4bHNTQXBxZz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null

          - client_certificate_config {
              - issue_client_certificate = false -> null
            }
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null

          - advanced_datapath_observability_config {
              - enable_metrics = false -> null
            }

          - managed_prometheus {
              - enabled = true -> null
            }
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      - node_config {
          - disk_size_gb      = 100 -> null
          - disk_type         = "pd-balanced" -> null
          - effective_taints  = [] -> null
          - guest_accelerator = [] -> null
          - image_type        = "COS_CONTAINERD" -> null
          - labels            = {
              - "env" = "guitarnetes1"
            } -> null
          - local_ssd_count   = 0 -> null
          - logging_variant   = "DEFAULT" -> null
          - machine_type      = "n1-standard-1" -> null
          - metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
            ] -> null
          - preemptible       = false -> null
          - resource_labels   = {} -> null
          - service_account   = "default" -> null
          - spot              = false -> null
          - tags              = [
              - "gke-node",
              - "guitarnetes1-gke",
            ] -> null

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }
        }

      - node_pool {
          - initial_node_count          = 1 -> null
          - instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-d/instanceGroupManagers/gke-guitarnetes-gke-node-pool-86b3f544-grp",
              - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-c/instanceGroupManagers/gke-guitarnetes-gke-node-pool-c4ee2e36-grp",
              - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-b/instanceGroupManagers/gke-guitarnetes-gke-node-pool-4a890e44-grp",
            ] -> null
          - managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-d/instanceGroups/gke-guitarnetes-gke-node-pool-86b3f544-grp",
              - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-c/instanceGroups/gke-guitarnetes-gke-node-pool-c4ee2e36-grp",
              - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-b/instanceGroups/gke-guitarnetes-gke-node-pool-4a890e44-grp",
            ] -> null
          - max_pods_per_node           = 110 -> null
          - name                        = "node-pool" -> null
          - node_count                  = 1 -> null
          - node_locations              = [
              - "us-east1-b",
              - "us-east1-c",
              - "us-east1-d",
            ] -> null
          - version                     = "1.27.4-gke.900" -> null

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = true -> null
            }

          - network_config {
              - create_pod_range     = false -> null
              - enable_private_nodes = false -> null
              - pod_ipv4_cidr_block  = "10.116.0.0/14" -> null
              - pod_range            = "gke-guitarnetes-gke-pods-ec40f406" -> null
            }

          - node_config {
              - disk_size_gb      = 100 -> null
              - disk_type         = "pd-balanced" -> null
              - effective_taints  = [] -> null
              - guest_accelerator = [] -> null
              - image_type        = "COS_CONTAINERD" -> null
              - labels            = {
                  - "env" = "guitarnetes1"
                } -> null
              - local_ssd_count   = 0 -> null
              - logging_variant   = "DEFAULT" -> null
              - machine_type      = "n1-standard-1" -> null
              - metadata          = {
                  - "disable-legacy-endpoints" = "true"
                } -> null
              - oauth_scopes      = [
                  - "https://www.googleapis.com/auth/logging.write",
                  - "https://www.googleapis.com/auth/monitoring",
                ] -> null
              - preemptible       = false -> null
              - resource_labels   = {} -> null
              - service_account   = "default" -> null
              - spot              = false -> null
              - tags              = [
                  - "gke-node",
                  - "guitarnetes1-gke",
                ] -> null

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
              - strategy        = "SURGE" -> null
            }
        }

      - node_pool_defaults {
          - node_config_defaults {
              - logging_variant = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.0.1.2" -> null
          - public_endpoint         = "34.75.57.177" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - release_channel {
          - channel = "REGULAR" -> null
        }

      - security_posture_config {
          - mode               = "BASIC" -> null
          - vulnerability_mode = "VULNERABILITY_MODE_UNSPECIFIED" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }
    }

  # module.GKE.module.node_pool.data.google_container_engine_versions.gke_version will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "gke_version" {
      + default_cluster_version         = (known after apply)
      + id                              = (known after apply)
      + latest_master_version           = (known after apply)
      + latest_node_version             = (known after apply)
      + location                        = "us-east1"
      + release_channel_default_version = (known after apply)
      + release_channel_latest_version  = (known after apply)
      + valid_master_versions           = (known after apply)
      + valid_node_versions             = (known after apply)
      + version_prefix                  = "1.27."
    }

  # module.GKE.module.node_pool.google_container_node_pool.primary_nodes must be replaced
-/+ resource "google_container_node_pool" "primary_nodes" {
      ~ cluster                     = "guitarnetes-gke" -> "guitarnetes-gke-1" # forces replacement
      ~ id                          = "projects/guitarnetes1/locations/us-east1/clusters/guitarnetes-gke/nodePools/node-pool" -> (known after apply)
      ~ initial_node_count          = 1 -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-d/instanceGroupManagers/gke-guitarnetes-gke-node-pool-86b3f544-grp",
          - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-c/instanceGroupManagers/gke-guitarnetes-gke-node-pool-c4ee2e36-grp",
          - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-b/instanceGroupManagers/gke-guitarnetes-gke-node-pool-4a890e44-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-d/instanceGroups/gke-guitarnetes-gke-node-pool-86b3f544-grp",
          - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-c/instanceGroups/gke-guitarnetes-gke-node-pool-c4ee2e36-grp",
          - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-b/instanceGroups/gke-guitarnetes-gke-node-pool-4a890e44-grp",
        ] -> (known after apply)
      ~ max_pods_per_node           = 110 -> (known after apply)
        name                        = "node-pool"
      + name_prefix                 = (known after apply)
      ~ node_locations              = [
          - "us-east1-b",
          - "us-east1-c",
          - "us-east1-d",
        ] -> (known after apply)
      + operation                   = (known after apply)
      ~ version                     = "1.27.4-gke.900" -> (known after apply)
        # (3 unchanged attributes hidden)

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = true -> null
        }

      - network_config {
          - create_pod_range     = false -> null
          - enable_private_nodes = false -> null
          - pod_ipv4_cidr_block  = "10.116.0.0/14" -> null
          - pod_range            = "gke-guitarnetes-gke-pods-ec40f406" -> null
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ disk_type         = "pd-balanced" -> (known after apply)
          ~ effective_taints  = [] -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ logging_variant   = "DEFAULT" -> (known after apply)
          + min_cpu_platform  = (known after apply)
          - resource_labels   = {} -> null
          ~ service_account   = "default" -> (known after apply)
            tags              = [
                "gke-node",
                "guitarnetes1-gke",
            ]
            # (6 unchanged attributes hidden)

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
          - strategy        = "SURGE" -> null
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

Pusher: @Yanirw, Action: `pull_request`

Comment to apply these changes to the current environment